Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
        );
    }
}

void printAllLedsTime() {
    Serial.printf_P(PSTR("%s\n"), "Отображение текущих настроек всех прожекторов");
    printLEDTime(ONE);
    printLEDTime(TWO);
    printLEDTime(THREE);
    printLEDTime(FOUR);
    printLEDTime(FIVE);
    printLEDTime(SIX);
}
void printDoser(doserType dosertype) {
    uint8_t dosersCount(sizeof(dosers) / sizeof(*dosers));
    uint8_t index;
    bool found = false;
    for (size_t i = 0; i < dosersCount; i++) {
        if (dosers[i].type == dosertype) {
            index = i;
            i = dosersCount;
            found = true;
        }
    }
    if (!found) {
        Serial.printf_P(PSTR("%s\n"), "Дозатор не найден!!!");
    } else {
        Serial.printf_P(PSTR("%s: Вкл-%02d:%02d. Dir: %d. Step: %d. Enable: %d. Объём: %d.\n"), dosers[index].name.c_str(),
                        dosers[index].hour, dosers[index].minute, dosers[index].dirPin, dosers[index].stepPin,
                        dosers[index].enablePin, dosers[index].volume);
    }
}

void printAllDosers() {
    Serial.printf_P(PSTR("%s\n"), "Отображение текущих настроек всех прожекторов");
    printDoser(K);
    printDoser(NP);
    printDoser(Fe);
}
void setDoser(doserType dosertype) {
    uint8_t dosersCount = (sizeof(dosers) / sizeof(*dosers));
    String name;
    uint8_t i;
    bool found = false;
    for (size_t k = 0; k < dosersCount; k++) {
        if (dosers[k].type == dosertype) {
            name = dosers[k].name;
            i = k;
            found = true;
            k = dosersCount;
        }
    }
    if (!found) {
        Serial.printf_P(PSTR("%s %s %s\n"), "Дозатор", name.c_str(), "не найден");
    } else {
        if (!Firebase.getJSON(data, pathDoser + name)) {
            Serial.printf_P(PSTR("%s %s: %s\n"), "Ошибка загрузки параметров дозатора", name.c_str(), data.errorReason().c_str());
        } else {
            if ((data.dataType() == "json")) {
                String json = data.jsonString();
                StaticJsonDocument<166> doc;
                std::vector<String> vectorString;
                DeserializationError err = deserializeJson(doc, json);
                if (err) {
                    Serial.printf_P(PSTR("Ошибка десериализации: %s\n"), err.c_str());
                } else {
                    dosers[i].dirPin = doc["dirPin"];
                    dosers[i].stepPin = doc["stepPin"];
                    dosers[i].enablePin = doc["enablePin"];
                    dosers[i].sleepPin = doc["sleepPin"];
                    dosers[i].volume = doc["volume"];

                    vectorString = splitVector(doc["time"]);
                    dosers[i].hour = vectorString[0].toInt();
                    dosers[i].minute = vectorString[1].toInt();
                    
                    switch (dosertype) {
                        case K:
                            if (!doserK) {
                                doserK = std::make_unique<DRV8825>(MOTOR_STEPS, dosers[i].dirPin, dosers[i].stepPin,
                                                                   dosers[i].sleepPin, MODE0, MODE1, MODE2);
                            } else {
                                Serial.printf_P(PSTR("%s %s"), "Не удалось выделить память для дозатора", ToString(dosertype));
                            }
                            break;
                        case NP:
                            if (!doserNP) {
                                doserNP = std::make_unique<DRV8825>(MOTOR_STEPS, dosers[i].dirPin, dosers[i].stepPin,
                                                                    dosers[i].sleepPin, MODE0, MODE1, MODE2);
                            } else {
                                Serial.printf_P(PSTR("%s %s"), "Не удалось выделить память для дозатора", ToString(dosertype));
                            }
                            break;
                        case Fe:
                            if (!doserFe) {
                                doserFe = std::make_unique<DRV8825>(MOTOR_STEPS, dosers[i].dirPin, dosers[i].stepPin,
                                                                    dosers[i].sleepPin, MODE0, MODE1, MODE2);
                            } else {
                                Serial.printf_P(PSTR("%s %s"), "Не удалось выделить память для дозатора", ToString(dosertype));
                            }
                            break;
                        default:
                            Serial.printf_P(PSTR("%s %s"), "Неизвестный тип дозатора", ToString(dosertype));
                            break;
                    }
                    // TODO Add timer and DRV8825
                    dosers[i].alarm =
                        Alarm
                            .alarmRepeat(dosers[i].hour, dosers[i].minute, 0, )
                        /*
                        dosers[i].alarm=Alarm.alarmRepeat(dosers[i].hour,dosers[i].minute,0,)
                        leds[i].led.off = Alarm.alarmRepeat(leds[i].led.HOff, leds[i].led.MOff, 0, ledOffHandler, leds[i]);
                        leds[i].led.on = Alarm.alarmRepeat(leds[i].led.HOn, leds[i].led.MOn, 0, ledOnHandler, leds[i]);

                        uint8_t minutes = clockRTC.getDateTime().hour * 60 + clockRTC.getDateTime().minute;
                        uint8_t minutesOn = leds[i].led.HOn * 60 + leds[i].led.MOn;
                        uint8_t minutesOff = leds[i].led.HOff * 60 + leds[i].led.MOff;
                        if ((minutes > minutesOn) && (minutes < minutesOff)) {
                            ledOnHandler(leds[i]);
                        } else {
                            ledOffHandler(leds[i]);
                        }
                        */
                        doc.clear();
                }
            } else {
                Serial.printf_P(PSTR("%s\n"), "Ответ не является JSON объектом");
            }
        }
    }
}
//Загрузка времени включения/выключения прожектора
void setLEDTime(ledPosition position) {
    uint8_t ledsCount = (sizeof(leds) / sizeof(*leds));
    String ledPath;
    uint8_t i;
    bool found = false;
    for (size_t k = 0; k < ledsCount; k++) {
        if (leds[k].position == position) {
            ledPath = leds[k].name;
            i = k;
            found = true;
            k = ledsCount;
        }
    }
    if (found) {
        if (Firebase.getJSON(data, pathLight + ledPath)) {
            if ((data.dataType() == "json")) {
                String json = data.jsonString();
                StaticJsonDocument<180> doc;
                std::vector<String> vectorString;
                DeserializationError err = deserializeJson(doc, json);
                if (err) {
                    Serial.printf_P(PSTR("Ошибка десериализации: %s\n"), err.c_str());
                } else {
                    leds[i].led.enabled = doc["enabled"];
                    leds[i].led.pin = doc["pin"];
                    leds[i].led.currentState = doc["state"];

