Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
void Timer1Min() {
    ledState_t currentLed;
    Serial.println(ESP.getFreeHeap());
    char* p = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    Serial.printf_P(PSTR("%s "), String(p).c_str());
    free(p);
    Serial.println(ESP.getFreeHeap());
    getTemperature();
    checkUpdateSettings();
    if (shouldUpdateFlag) {
        readOptionsFirebase();
        printAllLedsTime();
        printAllDosers();
        shouldUpdateFlag = false;
    }
    while (!vectorState.empty()) {
        currentLed = vectorState.back();
        setCurrentState(currentLed.state, currentLed.name);
        vectorState.pop_back();
    }
    vectorState.clear();
}
void startMainTimers() {
    Serial.printf_P(PSTR("%s -> %d\n"), "Таймеры: основные", Alarm.count());
    Alarm.timerRepeat(5 * 60, Timer5Min);  // сохраняем температуру в Firebase/EEPROM
    Alarm.timerRepeat(20, Timer1Min);      // вывод uptime и тмемпературу каждую минуту
    Serial.printf_P(PSTR("%s -> %d\n"), "Таймеры: основные и прожекторные", Alarm.count());
}
void checkUpdateSettings() {
    if (Firebase.getBool(data, pathUpdateSettings)) {
        if (data.dataType() == "boolean") {
            if (data.boolData()) {
                Serial.printf_P(PSTR("%s\n"), "Запрос на обновление всех настроек");
                shouldUpdateFlag = true;
                clearAlarms();
                if (!Firebase.setBool(data, pathUpdateSettings, false)) {
                    Serial.printf_P(PSTR("%s: %s\n"), "Не удалось отключить флаг сброса настроек", data.errorReason().c_str());
                }
            }
        } else {
            Serial.printf_P(PSTR("%s\n"), "Флаг сброса настроек UpdateSettings должен быть типа boolean");
        }
    } else {
        Serial.printf_P(PSTR("Ошибка чтения флага сброса настроек UpdateSettings: %s\n"), data.errorReason().c_str());
    }
}
void startDoser() {
    // blink the led, to indicate motor1 has started
    /* digitalWrite(0, HIGH);
     stepper1.begin(rpm.data, 16);
     stepper1.rotate(360);
     digitalWrite(0, LOW);
     */
}
void setup() {
    Serial.begin(115200);
    Serial.println();

    //Запуск часов реального времени
    initRTC();
    initLeds();
    initDosers();
    getTemperature();

    Serial.printf_P(PSTR("%s: %s\n"), "Подключение к WiFi", WIFI_SSID);
    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
    WiFi.setAutoReconnect(true);
    while ((WiFi.status() != WL_CONNECTED) && (wifiConnectCount != wifiMaxTry)) {
        Serial.printf_P(PSTR("%s"), ".");
        delay(500);
        wifiConnectCount++;
    }

    if (WiFi.status() != WL_CONNECTED) {
        wifiConnectCount = 0;
        Serial.printf_P(PSTR("%s: %s\n"), "Не удалось подключиться к WiFi", WIFI_SSID);
        readOptionsEEPROM();
    } else {
        Serial.printf_P(PSTR("\n%s: %s IP: %s\n"), "Успешное подключение к WiFi", WIFI_SSID, WiFi.localIP().toString().c_str());
        WiFi.hostname(WiFi_hostname);
        setClock();
        Firebase.begin(FIREBASE_HOST, FIREBASE_AUTH);
        Firebase.reconnectWiFi(true);

        data.fcm.begin(FIREBASE_FCM_SERVER_KEY);
        data.fcm.addDeviceToken(FIREBASE_FCM_DEVICE_TOKEN);
        data.fcm.setPriority("high");
        data.fcm.setTimeToLive(1000);

        sendMessage();
        writeBootHistory();
        syncTime();  // синхронизируем время
        readOptionsFirebase();
        printAllLedsTime();
        printAllDosers();
    }
    startMainTimers();
    Timer5Min();
    // stepper.begin(RPM, MICROSTEPS);
    // stepper.move(11);
}
void prWiFiStatus(int s) {
#define VALCASE(x)                    \
    case x:                           \
        Serial.print("WiFi.status "); \
        Serial.println(#x);           \
        break;

    switch (s) {
        VALCASE(WL_NO_SHIELD);
        VALCASE(WL_IDLE_STATUS);
        VALCASE(WL_NO_SSID_AVAIL);
        VALCASE(WL_SCAN_COMPLETED);
        VALCASE(WL_CONNECTED);
        VALCASE(WL_CONNECT_FAILED);
        VALCASE(WL_CONNECTION_LOST);
        VALCASE(WL_DISCONNECTED);
        default:
            Serial.println(s);
            break;
    }
}
void loop() {
    Alarm.delay(10);
    currentMillis = millis();

    if (currentMillis - previousMillis > 60000UL) {
        previousMillis = currentMillis;
        // prWiFiStatus(WiFi.status());
        // energize coils - the motor will hold position
        // stepper.enable();

        /*
         * Moving motor one full revolution using the degree notation
         */
        // stepper.rotate(360);

        /*
         * Moving motor to original position using steps
         */
        // stepper.move(-MOTOR_STEPS * MICROSTEPS);

        // pause and allow the motor to be moved by hand
        // stepper.disable();

        // delay(5000);
    }
}
